In [1]:
import pandas as pd

In [2]:
df_source = pd.read_csv(r"C:\Users\user\PycharmProjects\PythonProject_01\Pandas basics\source_data.csv")

In [3]:
df_source

   id     name  amount        date
0   1    Alice    -500  2023-01-01
1   2      BOB    1500  2023-01-05
2   3  Charlie    2000  2023-01-10
3   4    David    2500  2023-01-15
4   5      EVE    3000  2023-01-20

In [4]:
df_target = pd.read_csv(r"C:\Users\user\PycharmProjects\PythonProject_01\Pandas basics\target_data.csv")

In [5]:
df_target

   id     name  amount        date
0   1    ALICE    1000  2023-01-01
1   2      BOB    1500  2023-01-05
2   3  CHARLIE    2100  2023-01-10
3   4    DAVID    2500  2023-01-15
4   5      EVE    3000  2023-01-20

In [6]:
df_source.info()
df_target.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      5 non-null      int64
 1   name    5 non-null      object
 2   amount  5 non-null      int64
 3   date    5 non-null      object
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      5 non-null      int64
 1   name    5 non-null      object
 2   amount  5 non-null      int64
 3   date    5 non-null      object
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [7]:
print("Source Data:")

display(df_source)

print("------------------")

print("Target Data:")

display(df_target)
print("------------------")

print("Source Info:")
df_source.info()



print("------------------")



print("Target Info:")
df_target.info()

Source Data:

   id     name  amount        date
0   1    Alice    -500  2023-01-01
1   2      BOB    1500  2023-01-05
2   3  Charlie    2000  2023-01-10
3   4    David    2500  2023-01-15
4   5      EVE    3000  2023-01-20

------------------
Target Data:

   id     name  amount        date
0   1    ALICE    1000  2023-01-01
1   2      BOB    1500  2023-01-05
2   3  CHARLIE    2100  2023-01-10
3   4    DAVID    2500  2023-01-15
4   5      EVE    3000  2023-01-20

------------------
Source Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      5 non-null      int64
 1   name    5 non-null      object
 2   amount  5 non-null      int64
 3   date    5 non-null      object
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes
------------------
Target Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      5 non-null      int64
 1   name    5 non-null      object
 2   amount  5 non-null      int64
 3   date    5 non-null      object
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [8]:
assert df_source.shape[0] == df_target.shape[0],"Count is Not Matching"
print("Perfect !! Count Matched !")

Perfect !! Count Matched !

In [9]:
#same non-null count across both DataFrames.
df_source.count() == df_target.count()

id        True
name      True
amount    True
date      True
dtype: bool

In [10]:
#all counts match
#assert (df_source.count() == df_target.count()).all(), "Column-wise count mismatch!"
#print("All column counts match.")

In [11]:
#   assert().all(),'count mistmatched'
#    print('all count matched')

assert(df_source.count() == df_target.count()).all(),'count mistmatched'
print('all count matched')

all count matched

In [12]:
#compare data types between two DataFrames: type 1
(df_source.dtypes) == (df_target.dtypes)

id        True
name      True
amount    True
date      True
dtype: bool

In [13]:
#compare data types between two DataFrames: type 2
(df_source.dtypes == df_target.dtypes).all()

np.True_

In [14]:
#compare data types between two DataFrames: type 3
assert(df_source.dtypes == df_target.dtypes).all(),'Not Matching'
print('All the data type is Matching')

All the data type is Matching

In [15]:
mismatched_types = df_source.columns[df_source.columns != df_target.columns]
if not mismatched_types.empty:
    print("Mismatched data types found:")
    print(mismatched_types)
else:
    print("All data types match.")

All data types match.

In [16]:
## Column & Data Type Validation

#List of the columns and count od total columns 
print ('Source Columns:', df_source.columns.to_list, len(df_source.columns))
print ('Target Columns:', df_target.columns.to_list, len(df_source.columns))

Source Columns: <bound method IndexOpsMixin.tolist of Index(['id', 'name', 'amount', 'date'], dtype='object')> 4
Target Columns: <bound method IndexOpsMixin.tolist of Index(['id', 'name', 'amount', 'date'], dtype='object')> 4

In [17]:
## Null Check

print("Nulls in Source :")
print(df_source.isnull().sum())

print("Nulls in Target :")
print(df_target.isnull().sum())

Nulls in Source :
id        0
name      0
amount    0
date      0
dtype: int64
Nulls in Target :
id        0
name      0
amount    0
date      0
dtype: int64

In [18]:
## Duplicate Check

print('Duplicate in Source:',df_source.duplicated().sum())
print('Duplicate in Target:',df_target.duplicated().sum())
print(df_source)
print(df_target)

Duplicate in Source: 0
Duplicate in Target: 0
   id     name  amount        date
0   1    Alice    -500  2023-01-01
1   2      BOB    1500  2023-01-05
2   3  Charlie    2000  2023-01-10
3   4    David    2500  2023-01-15
4   5      EVE    3000  2023-01-20
   id     name  amount        date
0   1    ALICE    1000  2023-01-01
1   2      BOB    1500  2023-01-05
2   3  CHARLIE    2100  2023-01-10
3   4    DAVID    2500  2023-01-15
4   5      EVE    3000  2023-01-20

In [19]:
#Print Duplicates from df_source
duplicates_source = df_source[df_source.duplicated()]
print("Duplicate rows in df_source:")
print(duplicates_source)


#Print Duplicates from df_target
duplicates_target = df_target[df_target.duplicated()]
print("Duplicate rows in df_target:")
print(duplicates_target)

Duplicate rows in df_source:
Empty DataFrame
Columns: [id, name, amount, date]
Index: []
Duplicate rows in df_target:
Empty DataFrame
Columns: [id, name, amount, date]
Index: []

In [20]:
## Data Accuracy Check
# This compares the entire DataFrame (df_source) with df_target.
# It checks:

# 1. Do both DataFrames have the same shape (same rows & columns)?
# 2. Are the column names and their order exactly the same?
# 3. Are the row indexes exactly the same?
# 4. Is every single value in every cell the same (including NaN vs NaN)?

# It returns:
# True  → if everything matches exactly
# False → if any difference exists

comparison_result = df_source.equals(df_target)
print("Data Match:", comparison_result)

Data Match: False

In [21]:
#step 1 Compare element-wise
#True means the value does not match i.e. source values not matching with target values
#False means the value matches
comparison_df = df_source != df_target

#step 2 Filter the mismatches
mismatch_locations = comparison_df.any(axis=1)  # find rows with any mismatch
mismatched_rows = df_source[mismatch_locations]
print("Rows with mismatches (from df_source):")
print(mismatched_rows)

print("\nCorresponding rows from df_target:")
print(df_target[mismatch_locations])

Rows with mismatches (from df_source):
   id     name  amount        date
0   1    Alice    -500  2023-01-01
2   3  Charlie    2000  2023-01-10
3   4    David    2500  2023-01-15

Corresponding rows from df_target:
   id     name  amount        date
0   1    ALICE    1000  2023-01-01
2   3  CHARLIE    2100  2023-01-10
3   4    DAVID    2500  2023-01-15

In [22]:
#-- mistmatched data printing  - Source --#
df_comparison = df_source != df_target
df_comparison
mistmatch = df_comparison.any(axis=1)
mistmatch_row = df_source[mistmatch]
print('mistmatch_row from source')
print(mistmatch_row)

print('---------------------------------------')

#-- mistmatched data printing  - Source --#
df_comparison = df_source != df_target
df_comparison
mistmatch = df_comparison.any(axis=1)
mistmatch_row = df_target[mistmatch]
print('mistmatch_row from target')
print(mistmatch_row)

mistmatch_row from source
   id     name  amount        date
0   1    Alice    -500  2023-01-01
2   3  Charlie    2000  2023-01-10
3   4    David    2500  2023-01-15
---------------------------------------
mistmatch_row from target
   id     name  amount        date
0   1    ALICE    1000  2023-01-01
2   3  CHARLIE    2100  2023-01-10
3   4    DAVID    2500  2023-01-15

In [27]:
#Business Rule Validation Example

assert (df_source['amount']> 0).all(), "Some Values are less than Zero"
print(df_source)

AssertionError: Some Values are less than Zero

In [28]:
# Print only invalid rows
print("Invalid rows (amount <= 0):")
print(df_source[df_source['amount'] <= 0])

Invalid rows (amount <= 0):
   id   name  amount        date
0   1  Alice    -500  2023-01-01

In [ ]:
# Null heatmap
sns.heatmap(df_target.isnull(), cbar=False)
plt.title("Null Value Heatmap - Target Data")
plt.show()

In [ ]:
#import numpy as np
# df_source.to_excel("source_output.xlsx", index=False)
# df_target.to_excel("target_output.xlsx", index=False)